Autodesk.Revit.DB.Electrical.GroundConductorSizeSet
A set that contains GroundConductorSizes.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Insert(Autodesk.Revit.DB.Electrical.GroundConductorSize)
System.Int32
Insert the specified GroundConductorSize into the set.
item: The GroundConductorSize to be inserted into the set.
Returns: Returns whether the GroundConductorSize was inserted into the set.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.GroundConductorSizeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.GroundConductorSizeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Erase(Autodesk.Revit.DB.Electrical.GroundConductorSize)
System.Int32
Removes a specified GroundConductorSize from the set.
item: The GroundConductorSize to be erased.
Returns: The number of GroundConductorSizes that were erased from the set.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Contains(Autodesk.Revit.DB.Electrical.GroundConductorSize)
System.Boolean
Tests for the existence of a GroundConductorSize within the set.
item: The GroundConductorSize to be searched for.
Returns: The Contains method returns True if the GroundConductorSize is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Clear
void
Removes every GroundConductorSize from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Size
System.Int32
get
Returns the number of GroundConductorSizes that are in the set.

Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.